thucnguyen12/gd32/Template/main.c
void build_min_tx_data_from_spi(min_msg_t* min_msg, uint8_t* data_spi, uint8_t size)
{
    min_msg->id = MIN_ID_RECIEVE_SPI_FROM_GD32;
    memcpy (min_msg->payload, data_spi, size);
    min_msg->len = size;
}
//MIN DATA PLACE END

//LCD PLACE function

void lcd_clr_screen(void)
{
	u8g2_ClearBuffer(&m_u8g2);
	u8g2_ClearDisplay(&m_u8g2);
	u8g2_FirstPage(&m_u8g2);
}

void lcd_display_content(const char *msg)
{
	lcd_clr_screen();
	do
	{
		u8g2_DrawUTF8(&m_u8g2,
					  LCD_MEASURE_X_CENTER(u8g2_GetUTF8Width(&m_u8g2, msg)),
					  20+LCD_MEASURE_Y_CENTER(u8g2_GetMaxCharHeight(&m_u8g2)),
					  msg);
	} while (u8g2_NextPage(&m_u8g2));
	u8g2_SendBuffer(&m_u8g2);
}


void lcd_display_content_at_pos(const char *msg, u8g2_uint_t x, u8g2_uint_t y)
{
	//lcd_clr_screen();
	//	u8g2_ClearBuffer(&m_u8g2);
	//	u8g2_FirstPage(&m_u8g2);
	char tmp[24];

	u8g2_SetFont(&m_u8g2, u8g2_font_6x13_tf);
	do
	{
		u8g2_DrawUTF8(&m_u8g2, x, y, msg);
	} while (u8g2_NextPage(&m_u8g2));
	u8g2_SendBuffer(&m_u8g2);
}

void lcd_display_status (void)
{
    char counter[24];
    lcd_clr_screen();
    u8g2_ClearBuffer(&m_u8g2);

    // Display header
    //RTC_TimeTypeDef time;
    //HAL_RTC_GetTime(&hrtc, &time, RTC_FORMAT_BIN);
//    rtc_timestamp_get(&rtc_timestamp);
//    /* get the subsecond value of timestamp time, and convert it into fractional format */
//    uint32_t ts_subsecond;
//    uint8_t ts_subsecond_ss,ts_subsecond_ts,ts_subsecond_hs;
//    ts_subsecond = rtc_timestamp_subsecond_get();
//    ts_subsecond_ss=(1000-(ts_subsecond*1000+1000)/400)/100;
//    ts_subsecond_ts=(1000-(ts_subsecond*1000+1000)/400)%100/10;
//    ts_subsecond_hs=(1000-(ts_subsecond*1000+1000)/400)%10;
    sprintf(counter, "%02u:%02u:%02u", rtc_timestamp.rtc_timestamp_hour, rtc_timestamp.rtc_timestamp_minute, rtc_timestamp.rtc_timestamp_second);
    u8g2_SetFont(&m_u8g2, u8g2_font_unifont_t_vietnamese1); // can chon font cho header
    do
    {
        u8g2_DrawUTF8(&m_u8g2,
                      LCD_MEASURE_X_CENTER(u8g2_GetUTF8Width(&m_u8g2, counter)),
                      15,
                      counter);
    } while (u8g2_NextPage(&m_u8g2));

    u8g2_SetFont(&m_u8g2, u8g2_font_6x13_tf);
    if (network_status == WIFI_CONNECT)
    {
        sprintf(counter, "WIFI CONNECTED");
    }
    else if (network_status == ETH_CONNECT)
    {
        sprintf(counter, "ETH CONNECTED");
    }
    else if (network_status == GSM_CONNECT)
    {
        sprintf(counter, "GSM CONNECTED");
    }
    else
    {
        sprintf(counter, "LOST CONNECTION");
    }
    u8g2_DrawUTF8(&m_u8g2, 32, 38, counter);
    
    //sprintf(counter, "IMEI %s", final_jig_value.gsm_imei);
    //u8g2_DrawUTF8(&m_u8g2, 5,55, counter);
    u8g2_SendBuffer(&m_u8g2);
}

void build_device_type_string (uint8_t device_type, char* device_string)
{
    switch (device_type)
    {
        case 1:
        break;
        default:
        break;
    }
}

void lcd_display_trouble (trouble_info_of_note_t* trouble_info_table, uint8_t trouble_sensor_cnt)
{
    char counter[24];
    lcd_clr_screen();
    u8g2_ClearBuffer(&m_u8g2);
    u8g2_SetFont(&m_u8g2, u8g2_font_unifont_t_vietnamese1); // can chon font cho header
    
    sprintf(counter, "TIME %02u:%02u:%02u", (trouble_info_table[trouble_sensor_cnt]).time_got_trouble.hour,
                                   (trouble_info_table[trouble_sensor_cnt]).time_got_trouble.minute,
                                   (trouble_info_table[trouble_sensor_cnt]).time_got_trouble.second);
    do
    {
        u8g2_DrawUTF8(&m_u8g2,
                      LCD_MEASURE_X_CENTER(u8g2_GetUTF8Width(&m_u8g2, counter)),
                      15,
                      counter);
    }while (u8g2_NextPage(&m_u8g2));
#warning "dinh nghia device type"
    char dv_string[32];
    build_device_type_string(trouble_info_table->deviceType, dv_string);
    sprintf(counter, "%s", dv_string);
    u8g2_DrawUTF8(&m_u8g2, 32, 38, counter);
    u8g2_SetFont(&m_u8g2, u8g2_font_6x13_tf);
    sprintf(counter, "MAC ALARM:%s", (trouble_info_table[trouble_sensor_cnt]).MAC);
    u8g2_DrawUTF8(&m_u8g2, 32, 46, counter);
    u8g2_SendBuffer(&m_u8g2);
}

/*
    COPY DATA FROM SPI INTO TABLE
*/

void add_info_into_trouble_mac_table (trouble_info_of_note_t* trouble_info_table, char* MAC, uint8_t deviceType, uint32_t timestamp)
{
//    uint32_t ts_subsecond = 0;
//    uint8_t ts_subsecond_ss,ts_subsecond_ts,ts_subsecond_hs ;
  
//    rtc_timestamp_get(&rtc_timestamp);
//    /* get the subsecond value of timestamp time, and convert it into fractional format */
//    ts_subsecond = rtc_timestamp_subsecond_get();
//    ts_subsecond_ss=(1000-(ts_subsecond*1000+1000)/400)/100;
//    ts_subsecond_ts=(1000-(ts_subsecond*1000+1000)/400)%100/10;
//    ts_subsecond_hs=(1000-(ts_subsecond*1000+1000)/400)%10;
//    time_now.day = convert_bcd_to_dec (rtc_timestamp.rtc_timestamp_date);
//    time_now.month = (rtc_timestamp.rtc_timestamp_month);
//    time_now.year = convert_bcd_to_dec (rtc_initpara.rtc_year);
//    time_now.hour = (rtc_timestamp.rtc_timestamp_hour);
//    time_now.minute = convert_bcd_to_dec (rtc_timestamp.rtc_timestamp_minute);
//    time_now.second = convert_bcd_to_dec (rtc_timestamp.rtc_timestamp_second);
    date_time_t time_now;
    convert_second_to_date_time (timestamp, &time_now, 1);
    memcpy (&(trouble_info_table->time_got_trouble), &time_now, sizeof(date_time_t));
    memcpy (&(trouble_info_table->MAC), MAC, sizeof(trouble_info_table->MAC));
    trouble_info_table->deviceType = deviceType;
}

void check_trouble_MAC (trouble_info_of_note_t* trouble_info_table)
{
    char mac_sample[6];
    memset (mac_sample,'\0', sizeof (mac_sample));
    static uint8_t i = 0;
    
    if (i < MAX_BEACON_SENSOR)
    {
        if (memcmp (trouble_info_table[i].MAC, mac_sample, sizeof (mac_sample)) != 0)
        {
            lcd_display_trouble (trouble_info_table, i);
            i++;
            if (i > MAX_BEACON_SENSOR) // all note get trouble
            {
                i = 0;
            }
        }
        else
        {
            // display again from start or no one got trouble
            i = 0;
        }
    }
}

//LCD PLACE END

