thucnguyen12/gd32/Template/main.c
//DEBUG OUTPUT

uint32_t rtt_tx(const void *buffer, uint32_t size)
{
    return SEGGER_RTT_Write(0, buffer, size);
}


// TEST SPI PING

uint8_t request_spi_message(uint8_t* p_out, uint8_t MSG_ID, void* input)
{
    nrf52_format_packet_t nrf52_local_packet;
    nrf52_local_packet.format.token = APP_GD32_SPI_TOKEN;
    nrf52_local_packet.format.msg_id = MSG_ID;
    nrf52_local_packet.format.msg_length = 0;
    memset(&nrf52_local_packet.format.payload, 0, sizeof(nrf52_local_packet.format.payload));
    // need to send msg config
    if ((MSG_ID == APP_SPI_KEY_CONFIG) && (input != NULL))
    {
        input = (ble_config_t *) input;
        memcpy(&nrf52_local_packet.format.payload, input, sizeof(ble_config_t));
    }
    else if ((MSG_ID == APP_SPI_SYN_TIME) && (input != NULL))    
    {
        input = (uint32_t *) input;
        memcpy(&nrf52_local_packet.format.payload, input, sizeof(uint32_t));
    }
    /*Write*/
    /*nrF52 CS Pin*/
    
    DEBUG_INFO ("send test spi msg\r\n");
    gpio_bit_reset(GPIO_NRF_CS_PORT, GPIO_NRF_CS_PIN);
    for(uint16_t i = 0; i < sizeof(nrf52_format_packet_t); i++)
    {
        uint32_t Timeout = 1000;
        //SPI_transmit_self_recieve (&(nrf52_local_packet.value[i]));  // if there are hardware UNCOMMENT THIS LINE 
        while(RESET == spi_i2s_flag_get(SPI0, SPI_FLAG_TBE) && Timeout) {
            if ((Timeout % 100) == 0)
            fwdgt_counter_reload();
            Timeout--;
        }
            spi_i2s_data_transmit(SPI0, nrf52_local_packet.value[i]);
        while(spi_i2s_flag_get(SPI0, SPI_FLAG_RBNE) == RESET && Timeout) {        
            if ((Timeout % 100) == 0)
            fwdgt_counter_reload();
            Timeout--;
        }
            nrf52_local_packet.value[i] = spi_i2s_data_receive(SPI0);
    }
    // wait until tranfer data completely
    while(SET == spi_i2s_flag_get(SPI0, SPI_STAT_TRANS)) {
    }
    gpio_bit_set(GPIO_NRF_CS_PORT, GPIO_NRF_CS_PIN);
    for (uint8_t i = 0; i < 255; i++)
    {
        if((i %10) == 0)
        {
            DEBUG_RAW("\r\n");
        }
        DEBUG_RAW ("%x-",(uint8_t)nrf52_local_packet.value[i]);
        
    }
        DEBUG_RAW ("\r\n");
    uint8_t ping_msg_length = 0;
    if(nrf52_local_packet.format.token == APP_GD32_SPI_TOKEN && nrf52_local_packet.format.msg_id == MSG_ID)
    {
        DEBUG_INFO("Found msg response\r\n");
        ping_msg_length = nrf52_local_packet.format.msg_length;
        if (MSG_ID == APP_SPI_PING_MSG)
        {
            app_beacon_ping_msg_t *p_ping_msg = (app_beacon_ping_msg_t*)&nrf52_local_packet.format.payload;
            /*<Only for Debug>*/
        
            DEBUG_INFO("Alarm value:%08x\r\nTotal Sensor count:%u\r\nPair mode:%d\r\nGateway Mac:", p_ping_msg->alarm_value.Value, p_ping_msg->sensor_count, p_ping_msg->in_pair_mode);
            for(uint8_t  i = 0; i < 6; i++)
            {
                DEBUG_RAW("%02x-", p_ping_msg->gateway_mac[i]);
            }
            DEBUG_RAW("\r\nAppKey");
            for(uint8_t  i = 0; i < 16; i++)
            {
                DEBUG_RAW("%02x-", p_ping_msg->mesh_key.appkey[i]);
            }
            DEBUG_RAW("\r\nnetKey");
            for(uint8_t  i = 0; i < 16; i++)
            {
                DEBUG_RAW("%02x-", p_ping_msg->mesh_key.netkey[i]);
            }
            DEBUG_RAW("\r\n");
        }
        else if (MSG_ID == APP_SPI_BEACON_MSG)
        {
            app_beacon_data_t *p_data_msg = (app_beacon_data_t*) &nrf52_local_packet.format.payload;
            
        }
        else if ((MSG_ID == APP_SPI_KEY_CONFIG) || (MSG_ID == APP_SPI_SYN_TIME))
        {
            char * response_for_config = (char*) &nrf52_local_packet.format.payload;
            // if strstr (response_for_config, "CONFIG OK") { return ok no need send again}
        }
    }
    else
    {
        DEBUG_ERROR("Wrong ping response format\r\n");
    }
    memcpy (p_out, nrf52_local_packet.format.payload, ping_msg_length);
    // nRF52 CS PIN
    
    return ping_msg_length;
}


/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/

int main(void)
{
    /* configure systick */
    irc40k_config();
    systick_config();
    
    board_hw_initialize();
    
    lwrb_init(&uart_rb, uart_buffer, sizeof(uart_buffer));
    m_min_setting.get_ms = sys_get_ms;
    m_min_setting.last_rx_time = 0x00;
	m_min_setting.rx_callback = min_rx_callback;
	m_min_setting.timeout_not_seen_rx = 5000;
	m_min_setting.tx_byte = min_tx_byte;
	m_min_setting.use_timeout_method = 0;

    m_min_context.callback = &m_min_setting;
	m_min_context.rx_frame_payload_buf = min_rx_buffer;
	min_init_context(&m_min_context);
    
//*********  CONFIG BACKUP VALUE AND RTC*******    
    /* enable access to RTC registers in backup domain */
    rcu_periph_clock_enable(RCU_PMU);
    pmu_backup_write_enable();
  
    rtc_pre_config();
    rtc_tamper_disable(RTC_TAMPER0);
  
    /* check if RTC has aready been configured */
    if (BKP_VALUE != RTC_BKP0){    
        rtc_setup(NULL); 
    }else{
        /* detect the reset source */
        if (RESET != rcu_flag_get(RCU_FLAG_PORRST)){
            DEBUG_INFO("power on reset occurred....\n\r");
        }else if (RESET != rcu_flag_get(RCU_FLAG_EPRST)){
            DEBUG_INFO("external reset occurred....\n\r");
        }
        DEBUG_INFO("no need to configure RTC....\n\r");
               
        //rtc_show_time(); // WE NEED DISPLAY TIME ON LCD ONCE A SECOND
    }
    
//    com_usart_init();
//    usart_enable(USART1);
//    //spi configuration
    //nvic_irq_enable (SPI0_IRQn, 1);
    spi_config ();
    spi_enable (SPI0);
    // app debug
    app_debug_init(sys_get_ms,NULL);
    app_debug_register_callback_print(rtt_tx);
    DEBUG_INFO ("APP DEBUG OK\r\n");
    while(RESET == usart_flag_get(USART0, USART_FLAG_TC));
    usart_interrupt_enable(USART0, USART_INT_RBNE);
	//usart_interrupt_enable(USART0, USART_INT_TBE);
    uint8_t databuff1[128];
    uint8_t spi_send [5] = "hello";
    while (1) 
        //debug place
    {   
        //min_send_frame(&m_min_context, (min_msg_t*)&ping_min_msg);
        DEBUG_INFO ("STILL RUN \r\n");
        ///pull cs is needed
//        gpio_bit_reset (GPIO_NRF_CS_PORT, GPIO_NRF_CS_PIN);
//        for (uint8_t i = 0; i < 5; i++)
//        {
//            SPI_transmit_self_recieve(&spi_send[i]);
//        }
//        while(SET == spi_i2s_flag_get(SPI0, SPI_STAT_TRANS)) {
//        }
//        gpio_bit_set (GPIO_NRF_CS_PORT, GPIO_NRF_CS_PIN);
        static uint8_t spi_msg_data[251];

