thucnguyen12/gd32/Template/main.c
        uint8_t byte_read = request_spi_message (spi_msg_data, APP_SPI_PING_MSG, NULL);
        delay_1ms (1300);
        
    }
#if 1 // paralle mode
	u8g2_Setup_st7920_p_128x64_f(&m_u8g2, U8G2_R2, u8x8_byte_8bit_8080mode, u8g2_gpio_8080_update_and_delay);
#else
#warning "do nothing"
//	software_spi_cfg_t spi_cfg;
//	spi_cfg.cs_out = software_spi_set_cs;
//	spi_cfg.miso_in = software_spi_read_miso;
//	spi_cfg.mosi_out = software_spi_set_mosi;
//	spi_cfg.sck_out = software_spi_set_sck;
//	software_spi_inititalize(&spi_cfg);
//	u8g2_Setup_st7920_s_128x64_f(&m_u8g2, U8G2_R0, u8x8_byte_3wire_sw_spi, u8g2_gpio_3w_spi_update_and_delay);
#endif
	u8g2_InitDisplay(&m_u8g2);	   // send init sequence to the display, display is in sleep mode after this,
	u8g2_SetPowerSave(&m_u8g2, 0); // wake up display
	u8g2_ClearBuffer(&m_u8g2);
	u8g2_ClearDisplay(&m_u8g2);
    
    
//    /* print out the clock frequency of system, AHB, APB1 and APB2 */
//    DEBUG_INFO("\r\nCK_SYS is %d", rcu_clock_freq_get(CK_SYS));
//    DEBUG_INFO("\r\nCK_AHB is %d", rcu_clock_freq_get(CK_AHB));
//    DEBUG_INFO("\r\nCK_APB1 is %d", rcu_clock_freq_get(CK_APB1));
//    DEBUG_INFO("\r\nCK_APB2 is %d", rcu_clock_freq_get(CK_APB2));
    
    static uint32_t now = 0;
    static uint32_t last_time = 0;
    static uint32_t last_time_ping = 0;
    static uint32_t last_time_ask_beacon_data = 0;
    uint8_t databuff[128];
    size_t btr_m;
    min_msg_t min_data_buff;
    
//    lcd_clr_screen();
//    lcd_display_content ("lcd test");
//    DEBUG_INFO ("PASS LCD \r\n");
    fwdgt_config(4095, FWDGT_PSC_DIV256);
    //fwdgt_enable();
    DEBUG_INFO ("enable wdt \r\n");
    gpio_bit_set(GPIO_ESP_EN_PORT, GPIO_ESP_EN_PIN);
    
    //init some para
    memset (trouble_table_info_of_note,'\0', sizeof (trouble_table_info_of_note)); //reset list trouble mac

    while(1){
        /* reload FWDGT counter */
        fwdgt_counter_reload();
        
        now = sys_get_ms();
        if (check_ping_esp_s)
        {
            check_ping_esp_s = false;
            last_time = now;
        }
        
        if (((now - last_time) > 6000) && (!check_ping_esp_s) && esp32_started_s) //need to wait esp32 stable then check ping signal
        {
            // reset esp32
            last_time = now;
            DEBUG_INFO ("TIME OUT RESET ESP32\r\n");
            gpio_bit_reset(GPIO_ESP_EN_PORT, GPIO_ESP_EN_PIN);
            
            delay_1ms (1000);
            
            gpio_bit_set(GPIO_ESP_EN_PORT, GPIO_ESP_EN_PIN);
            esp32_started_s = false; // this time esp was dead, signal will be send again when esp32 is started
            continue;
            //restart loop
        }
        
        app_beacon_ping_msg_t* ble_status;
        if (((now - last_time_ping) > 1000))
        {
            last_time_ping = now;
            static uint8_t spi_msg_data[251];
            if (!in_pair_mode)
            {
                uint8_t byte_read = request_spi_message (spi_msg_data, APP_SPI_PING_MSG, NULL);
                
                // process and send data to esp (for ping msg)
                {
                    min_msg_t min_beacon_ping_msg;
                    min_beacon_ping_msg.id = MIN_ID_RECEIVE_HEARTBEAT_MSG;
                    min_beacon_ping_msg.payload = spi_msg_data;
                    min_beacon_ping_msg.len = byte_read;
                    send_min_data (&min_beacon_ping_msg);
                }
                lcd_display_status ();// hien thi trang thai khi khong o trang thai pair mode
            }
            // check spi data
            ble_status = (app_beacon_ping_msg_t*)&spi_msg_data;
            
            // TODO CHECK PAIR MODE
#warning "can doc ban tin check pair mode"
            if (ble_status->in_pair_mode)
            {
                // wait until it end
//                static uint32_t last_timeout = 0;
                lcd_display_content ("IN PAIR MODE");
                in_pair_mode = true;
                //hien thi them thoi gian trong pair mode
                
//                //start timeout counter
//                if ((now - last_timeout) > 1000)
//                {
//                    in_pair_mode = false;
//                    lcd_display_content ("PAIR TIMEOUT");
//                }
            }
            if ((!ble_status->in_pair_mode) && in_pair_mode)
            {
                // NOT IN PAIR MODE NOW ASK FOR NEW BEACON INFO
                static uint8_t spi_msg_data[251];
                request_spi_message (spi_msg_data, APP_SPI_NEW_BEACON_MSG, NULL); //ask about pair status
                beacon_pair_info_t *new_beacon;
                new_beacon = (beacon_pair_info_t *) spi_msg_data;
                if (new_beacon->pair_success)
                {
                    lcd_display_content ("PAIR SUCCESS");
                    char counter[32];
                    sprintf(counter, "%02x: %02x: %02x: %02x: %02x: %02x", ble_status->gateway_mac[0],
                                                                           ble_status->gateway_mac[1],
                                                                           ble_status->gateway_mac[2],
                                                                           ble_status->gateway_mac[3],
                                                                           ble_status->gateway_mac[4],
                                                                           ble_status->gateway_mac[5]);
                    lcd_display_content_at_pos (counter,38,39);
                }
                else if (new_beacon->pair_success == false)
                {
                    lcd_display_content ("PAIR TIMEOUT");
                }
                in_pair_mode = false; //clear pair mode flag       
            }
            if ((!in_pair_mode) && (!there_are_trouble))// neu khong trong pair mode va khong gap su co
            {
                lcd_display_status();
            }
        }
        // check if there are trouble
        if (there_are_trouble)
        {
            //co the check nut nhan de huy su co
            check_trouble_MAC(trouble_table_info_of_note);
            // if (dieu kien) {there_are_trouble = false}
        }
        // ask for becon data
        // if (((now - last_time_ask_beacon_data) > 3000) && (ble_status->sensor_count))
        if (/*(now - last_time_ask_beacon_data) > 10000*/0)
        {
            last_time_ask_beacon_data = now;
            static uint8_t spi_msg_beacon_data[251];
            app_beacon_data_t* ble_data;
            uint8_t byte_read = request_spi_message (spi_msg_beacon_data, APP_SPI_BEACON_MSG, NULL);
            ble_data = (app_beacon_data_t*) spi_msg_beacon_data;
            {
                /* send min data sequence */
                min_msg_t min_beacon_data_msg;
                min_beacon_data_msg.id = MIN_ID_SEND_AND_RECEIVE_BEACON_MSG;
                min_beacon_data_msg.payload = spi_msg_beacon_data;
                min_beacon_data_msg.len = byte_read;
                send_min_data (&min_beacon_data_msg);
            }
            for (uint8_t i = 0; i < MAX_BEACON_SENSOR; i++) //scan all sensor in trouble mac list
            {
                if (memcmp(ble_data->device_mac, trouble_table_info_of_note[i].MAC,6)) // new one got trouble
                {
                    if (ble_data->propreties.Name.alarmState) 
                    {
                        there_are_trouble = true;
                        //add mac to trouble mac list
                        add_info_into_trouble_mac_table(&trouble_table_info_of_note[i], 
                                                       (char *)(ble_data->device_mac),
                                                        ble_data->propreties.Name.deviceType,
                                                        ble_data->timestamp);
                    }
                }
            }
        }
        //feed data to min progress
        uint16_t uart_data_leng = lwrb_read (&uart_rb, databuff, 1);
        if (uart_data_leng)
        {
            DEBUG_VERBOSE ("DATA UART FROM ESP32\r\n");
            min_rx_feed (&m_min_context, databuff, uart_data_leng);
        }
        
        //transmit data to ask for spi data
        //spi_send_data ((char *)"need you send data", strlen ("need you send data"));
        
        
